---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailLateralOffset
source: html/94f15566-39d6-ef58-710f-77af3664011f.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailLateralOffset Property

The lateral offset of the primary handrail.

## Syntax (C#)
```csharp
public double PrimaryHandrailLateralOffset { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The rail has no primary hand rail.